app/views/urls/edit.html.erb

SELECT  "urls".* FROM "urls"  WHERE "urls"."newurl" = ? LIMIT 1  [["newurl", "FlickshagwellRoughlesbianpornDodo"]]
---
  <label>You are moist welcome.</label><br><br>
  <textarea readonly rows="3" id = "newurl" ><%= @base[0..(@base.length-6)]  %></textarea>