app/controllers/urls_controller.rb

  def index
  	Url.where("updated_at <= ?", Time.now - 7.days).destroy_all
---
SELECT "urls".* FROM "urls"  WHERE (updated_at <= '2015-09-07 22:34:27.686824')

  def create
  	count = 0
  	begin
  		temp = randphrase(3)
  		count = count+1
  	end while ( Url.exists?(:newurl => temp) and (count<19) )
  	@url = Url.new(url_params)
  	@url.newurl = temp
  	@url.oldurl = urlclean(@url.oldurl)
  	@url.save
---
SELECT  1 AS one FROM "urls"  WHERE "urls"."newurl" = 'TombraiderxxxBleachpornQuickiecreampie' LIMIT 1
INSERT INTO "urls" ("created_at", "id", "newurl", "oldurl", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-08-30 03:00:16.342927"], ["id", 0], ["newurl", "http://localhost:3000/urlsDild0sWankSmokingporn"], ["oldurl", "sdfs"], ["updated_at", "2015-08-30 03:00:16.342927"]]

  def show
    @url = Url.find(params[:newurl])
    redirect_to @url.oldurl
	@url.updated_at = Time.now
---
SELECT  "urls".* FROM "urls"  WHERE "urls"."newurl" = ? LIMIT 1  [["newurl", "0"]]
UPDATE "urls" SET "updated_at" = ? WHERE "urls"."newurl" = 'TussiRedheadfuckUglypussy'  [["updated_at", "2015-09-07 22:12:59.098050"]]

  def edit
    @url = Url.find(params[:newurl])
---
SELECT  "urls".* FROM "urls"  WHERE "urls"."newurl" = ? LIMIT 1  [["newurl", "27"]]